Tekla Open API Reference for Tekla Structures 2025
DrawingPluginBase.InputDefinition Class
 The InputDefinition class is a class for defining the plug-in dependency over the input (points or identifiers). The user implemented method DefineInput() of the DrawingPluginBase interface should return an array list of input definition instances. This defines the points and identifiers the plug-in will receive as input when the Run() method is called.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class InputDefinition : MarshalByRefObject
<SerializableAttribute>
Public NotInheritable Class InputDefinition
	Inherits MarshalByRefObject
The DrawingPluginBase.InputDefinition type exposes the following members.
Constructors
Name | Description
DrawingPluginBase.InputDefinition(Identifier, List<Point>)
 Creates a new input definition with multiple points.
DrawingPluginBase.InputDefinition(Identifier, Point)
 Creates a new input definition instance with one point.
DrawingPluginBase.InputDefinition(Identifier, Identifier)
 Creates a new input definition instance with one identifier.
DrawingPluginBase.InputDefinition(Identifier, Point, Point)
 Creates a new input definition instance with two points.
DrawingPluginBase.InputDefinition(Identifier, Point, Point, Point)
 Creates a new input definition instance with three points.
Top
Properties
Name | Description
Type
 The type of the input the current instance contains.
ViewId
 The view object's identifier.
Top
Methods
Name | Description
GetInput
 Returns the input Tekla Structures gave to the plug-in. The input is either a point instance, an identifier instance, an array list of points or an array list of identifiers. This is based on the input format returned from the DefineInput() method.
Top
See Also
Reference
Tekla.Structures.Plugins Namespace